# yazi
brew "yazi"
brew "ffmpeg-full"
brew "sevenzip"
brew "poppler"
brew "fd"
brew "resvg"
brew "imagemagick-full"
cask "font-symbols-only-nerd-font"

# nvim
brew "neovim"
brew "luarocks"
brew "ripgrep"
brew "tree-sitter-cli"

# terminal
brew "zoxide"
cask "wezterm"
brew "git"
brew "jq"
brew "fzf"
brew "mole"

# GIT
brew "git-crypt"

# node
brew "nvm"

cask "squirrel-app"        # Rime (Squirrel) input method
cask "microsoft-edge"
cask "obsidian"

# docker
brew "colima"
brew "docker"

# System
cask "stats"
cask "hiddenbar"          # menu bar item manager
cask "raycast"            # Launcher

# Security
brew "gnupg"

# IM
cask "slack"
cask "wechat"
